In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[2,3,4],[25,6,7]])

In [3]:
df

    0  1  2
0   2  3  4
1  25  6  7

In [4]:
ass =pd.DataFrame([[2,3,4,4],[12,3,21,3]],columns =["A","B","C","D"],index=["1","2"])

In [5]:
ass

    A  B   C  D
1   2  3   4  4
2  12  3  21  3

In [6]:
ass.head(3)

    A  B   C  D
1   2  3   4  4
2  12  3  21  3

In [7]:
ass.tail(2)

    A  B   C  D
1   2  3   4  4
2  12  3  21  3

In [8]:
ass.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [9]:
ass.index

Index(['1', '2'], dtype='object')

In [10]:
ass

    A  B   C  D
1   2  3   4  4
2  12  3  21  3

In [11]:
ass.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 1 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      int64
 1   B       2 non-null      int64
 2   C       2 non-null      int64
 3   D       2 non-null      int64
dtypes: int64(4)
memory usage: 80.0+ bytes

In [12]:
ass.describe()

               A    B          C         D
count   2.000000  2.0   2.000000  2.000000
mean    7.000000  3.0  12.500000  3.500000
std     7.071068  0.0  12.020815  0.707107
min     2.000000  3.0   4.000000  3.000000
25%     4.500000  3.0   8.250000  3.250000
50%     7.000000  3.0  12.500000  3.500000
75%     9.500000  3.0  16.750000  3.750000
max    12.000000  3.0  21.000000  4.000000

In [13]:
ass

    A  B   C  D
1   2  3   4  4
2  12  3  21  3

In [14]:
ass.nunique()

A    2
B    1
C    2
D    2
dtype: int64

In [15]:
ass.shape

(2, 4)

In [16]:
ass.size

8

In [17]:
#Loading files from the csv

In [18]:
ds= pd.read_csv("https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/warmup-data/coffee.csv")

In [19]:
ds

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [20]:
ds.columns

Index(['Day', 'Coffee Type', 'Units Sold'], dtype='object')

In [21]:
ds.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [22]:
ds.tail(1)

       Day Coffee Type  Units Sold
13  Sunday       Latte          35

In [23]:
ds.index

RangeIndex(start=0, stop=14, step=1)

In [24]:
ds.sample(3)

          Day Coffee Type  Units Sold
7    Thursday       Latte          30
12     Sunday    Espresso          45
5   Wednesday       Latte          25

In [25]:
#loc and iloc functiosn

In [26]:
#loc syntax is data.loc[rows,columns]

In [27]:
ds.loc[[1,2,3]]

       Day Coffee Type  Units Sold
1   Monday       Latte          15
2  Tuesday    Espresso          30
3  Tuesday       Latte          20

In [28]:
ds

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [29]:
ds.loc[2:6]

         Day Coffee Type  Units Sold
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25
6   Thursday    Espresso          40

In [30]:
ds.columns

Index(['Day', 'Coffee Type', 'Units Sold'], dtype='object')

In [31]:
ds.loc[:,["Units Sold"]]

    Units Sold
0           25
1           15
2           30
3           20
4           35
5           25
6           40
7           30
8           45
9           35
10          45
11          35
12          45
13          35

In [32]:
#iloc is simpler as it takes the indexing values only

In [33]:
ds

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [34]:
ds.iloc[1:4,[2,1]]

   Units Sold Coffee Type
1          15       Latte
2          30    Espresso
3          20       Latte

In [35]:
ds.index=ds["Day"]

In [36]:
ds

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35
Saturday    Saturday    Espresso          45
Saturday    Saturday       Latte          35
Sunday        Sunday    Espresso          45
Sunday        Sunday       Latte          35

In [37]:
ds.loc[["Monday"],["Day"]]

           Day
Day
Monday  Monday
Monday  Monday

In [38]:
#setting the specific value in the table:

In [39]:
ds= pd.read_csv("https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/warmup-data/coffee.csv")

In [40]:
ds

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [41]:
ds.iloc[[1],[2]]=100

In [42]:
ds.head(5)

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte         100
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [44]:
ds.loc[[2],["Units Sold"]]=95

In [45]:
ds.head(5)

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte         100
2    Tuesday    Espresso          95
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [47]:
ds.loc[0:5,["units Sold"]]=45

In [48]:
ds.head(5)

         Day Coffee Type  Units Sold  units Sold
0     Monday    Espresso          25        45.0
1     Monday       Latte         100        45.0
2    Tuesday    Espresso          95        45.0
3    Tuesday       Latte          20        45.0
4  Wednesday    Espresso          35        45.0

In [49]:
#accessing the specifc data